In [7]:
import pandas as pd

df = pd.read_csv(r"C:\Users\Monster\Desktop\CBS_CALISMALARI\getir_case_study\data\raw\siparis.csv")
df2= pd.read_csv(r"C:\Users\Monster\Desktop\CBS_CALISMALARI\getir_case_study\data\raw\warehouse.csv")

In [8]:
df.head()

,fid,order_id,latitude,longitude,basket_value,delivery duration,profit,revenue,client_id
0,0,81512055,40.186535,29.095203,637.6238,22.016667,-149.4062,344.3338,client_79144640
1,1,22267042,40.234744,28.836608,373.0099,9.966667,-17.7624,200.3235,client_24816618
2,2,88017435,40.217676,28.903509,837.5562,7.783333,-30.7442,432.8338,client_16797643
3,3,72989589,40.218052,28.945997,819.1121,15.466667,-86.2728,435.2127,client_78716540
4,4,42175004,40.194676,28.988171,187.6337,27.016667,88.7932,221.4132,client_84428508

In [9]:
df2.head()

   fid City_Name Warehouse1  Longitude   Latitude
0    0     Bursa       wh_1  28.913683  40.223470
1    1     Bursa       wh_2  29.009756  40.199254
2    2     Bursa       wh_3  28.969918  40.220589
3    3     Bursa       wh_4  29.057349  40.187396
4    4     Bursa       wh_5  28.953623  40.262806

In [10]:
df['order_id'].nunique()== df.shape[0]

True

In [16]:
df[['latitude', 'longitude']].dtypes

latitude     float64
longitude    float64
dtype: object

In [18]:
df2[['Latitude', 'Longitude']].dtypes

Latitude     float64
Longitude    float64
dtype: object

In [12]:
df[['latitude', 'longitude']].min()

latitude     40.168411
longitude    28.801976
dtype: float64

In [13]:
df[['latitude', 'longitude']].max()

latitude     40.275265
longitude    29.149295
dtype: float64

In [14]:
df2[['Latitude', 'Longitude']].min()

Latitude     40.184361
Longitude    28.839262
dtype: float64

In [15]:
df2[['Latitude', 'Longitude']].max()

Latitude     40.262806
Longitude    29.098166
dtype: float64

In [19]:
df[['latitude', 'longitude']].isnull().sum()

latitude     0
longitude    0
dtype: int64

In [21]:
df2[['Latitude', 'Longitude']].isnull().sum()

Latitude     0
Longitude    0
dtype: int64

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26222 entries, 0 to 26221
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   fid                26222 non-null  int64
 1   order_id           26222 non-null  int64
 2   latitude           26222 non-null  float64
 3   longitude          26222 non-null  float64
 4   basket_value       26222 non-null  float64
 5   delivery duration  26222 non-null  float64
 6   profit             26222 non-null  float64
 7   revenue            26222 non-null  float64
 8   client_id          26222 non-null  object
dtypes: float64(6), int64(2), object(1)
memory usage: 1.8+ MB

In [23]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   fid         9 non-null      int64
 1   City_Name   9 non-null      object
 2   Warehouse1  9 non-null      object
 3   Longitude   9 non-null      float64
 4   Latitude    9 non-null      float64
dtypes: float64(2), int64(1), object(2)
memory usage: 492.0+ bytes

In [24]:
import geopandas as gpd 

gdf = gpd.GeoDataFrame(df, geometry=gpd.points_from_xy(df["longitude"],df["latitude"]), crs="EPSG:4326")
gdf2 = gpd.GeoDataFrame(df2, geometry=gpd.points_from_xy(df2["Longitude"],df2["Latitude"]),crs="EPSG:4326")

In [25]:
gdf.head()

,fid,order_id,latitude,longitude,basket_value,delivery duration,profit,revenue,client_id,geometry
0,0,81512055,40.186535,29.095203,637.6238,22.016667,-149.4062,344.3338,client_79144640,POINT (29.0952 40.18653)
1,1,22267042,40.234744,28.836608,373.0099,9.966667,-17.7624,200.3235,client_24816618,POINT (28.83661 40.23474)
2,2,88017435,40.217676,28.903509,837.5562,7.783333,-30.7442,432.8338,client_16797643,POINT (28.90351 40.21768)
3,3,72989589,40.218052,28.945997,819.1121,15.466667,-86.2728,435.2127,client_78716540,POINT (28.946 40.21805)
4,4,42175004,40.194676,28.988171,187.6337,27.016667,88.7932,221.4132,client_84428508,POINT (28.98817 40.19468)

In [26]:
gdf2.head()

   fid City_Name Warehouse1  Longitude   Latitude                   geometry
0    0     Bursa       wh_1  28.913683  40.223470  POINT (28.91368 40.22347)
1    1     Bursa       wh_2  29.009756  40.199254  POINT (29.00976 40.19925)
2    2     Bursa       wh_3  28.969918  40.220589  POINT (28.96992 40.22059)
3    3     Bursa       wh_4  29.057349  40.187396   POINT (29.05735 40.1874)
4    4     Bursa       wh_5  28.953623  40.262806  POINT (28.95362 40.26281)

In [29]:
import os
from dotenv import load_dotenv

load_dotenv()
db_url = os.getenv("DB_URL")

In [30]:
from sqlalchemy import create_engine 
engine = create_engine(db_url)
gdf.to_postgis("siparis", engine, if_exists="replace", index=False)

In [31]:
gdf2.to_postgis("warehouse", engine, if_exists="replace", index=False)